# NonContinuousRailInfo Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NonContinuousRailInfo Class
Members See Also
---
A class which contains information needed to define a single non-continuous rail in a [!:Autodesk::Revit::DB::Architecture::RailingType].
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public class NonContinuousRailInfo : IDisposable
```

Visual Basic
---
```text
Public Class NonContinuousRailInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class NonContinuousRailInfo : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Architecture..::..NonContinuousRailInfo
# See Also
NonContinuousRailInfo Members
Autodesk.Revit.DB.Architecture Namespace